cases/case4/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            pressureInletVelocity;
        phi             phi;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletVelocity;
        phi             phi;
        value           uniform (0 0 0);
    }

    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    periodicx1
    {
        type            cyclic;
    }
    periodicx2
    {
        type            cyclic;
    }

}

// ************************************************************************* //
