cases/case4/constant/polyMesh/blockMeshDict
/*------------------------------*- C++ -*--------------------------------*\ 
| =========                 |                                             | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox       | 
|  \\    /   O peration     | Version:  2.4.0                             | 
|   \\  /    A nd           | Web:      www.openfoam.com                  | 
|    \\/     M anipulation  |                                             | 
\*-----------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1.0; 

vertices
(
    (    -125     -0.5        0)
    (     125     -0.5        0)
    (     125      0.5        0)
    (    -125      0.5        0)
    (    -125     -0.5        5)
    (     125     -0.5        5)
    (     125      0.5        5)
    (    -125      0.5        5)
    (    -125     -0.5      750)
    (     125     -0.5      750)
    (     125      0.5      750)
    (    -125      0.5      750)
);

edges
(
    spline 0 1 (
        ( -125.000000	-0.500000	0.000000 )
        ( -124.750000	-0.500000	0.000000 )
        ( -124.500000	-0.500000	0.000000 )
        ( -124.250000	-0.500000	0.000000 )
        ( -124.000000	-0.500000	0.000000 )
        ( -123.750000	-0.500000	0.000000 )
        ( -123.500000	-0.500000	0.000000 )
        ( -123.250000	-0.500000	0.000000 )
        ( -123.000000	-0.500000	0.000000 )
        ( -122.750000	-0.500000	0.000000 )
        ( -122.500000	-0.500000	0.000000 )
        ( -122.250000	-0.500000	0.000000 )
        ( -122.000000	-0.500000	0.000000 )
        ( -121.750000	-0.500000	0.000000 )
        ( -121.500000	-0.500000	0.000000 )
        ( -121.250000	-0.500000	0.000000 )
        ( -121.000000	-0.500000	0.000000 )
        ( -120.750000	-0.500000	0.000000 )
        ( -120.500000	-0.500000	0.000000 )
        ( -120.250000	-0.500000	0.000000 )
        ( -120.000000	-0.500000	0.000000 )
        ( -119.750000	-0.500000	0.000000 )
        ( -119.500000	-0.500000	0.000000 )
        ( -119.250000	-0.500000	0.000000 )
        ( -119.000000	-0.500000	0.000000 )
        ( -118.750000	-0.500000	0.000000 )
        ( -118.500000	-0.500000	0.000000 )
        ( -118.250000	-0.500000	0.000000 )
        ( -118.000000	-0.500000	0.000000 )
        ( -117.750000	-0.500000	0.000000 )
        ( -117.500000	-0.500000	0.000000 )
        ( -117.250000	-0.500000	0.000000 )
        ( -117.000000	-0.500000	0.000000 )
        ( -116.750000	-0.500000	0.000000 )
        ( -116.500000	-0.500000	0.000000 )
        ( -116.250000	-0.500000	0.000000 )
        ( -116.000000	-0.500000	0.000000 )
        ( -115.750000	-0.500000	0.000000 )
        ( -115.500000	-0.500000	0.000000 )
        ( -115.250000	-0.500000	0.000000 )
        ( -115.000000	-0.500000	0.000000 )
        ( -114.750000	-0.500000	0.000000 )
        ( -114.500000	-0.500000	0.000000 )
        ( -114.250000	-0.500000	0.000000 )
        ( -114.000000	-0.500000	0.000000 )
        ( -113.750000	-0.500000	0.000000 )
        ( -113.500000	-0.500000	0.000000 )
        ( -113.250000	-0.500000	0.000000 )
        ( -113.000000	-0.500000	0.000000 )
        ( -112.750000	-0.500000	0.000000 )
        ( -112.500000	-0.500000	0.000000 )
        ( -112.250000	-0.500000	0.000000 )
        ( -112.000000	-0.500000	0.000000 )
        ( -111.750000	-0.500000	0.000000 )
        ( -111.500000	-0.500000	0.000000 )
        ( -111.250000	-0.500000	0.000000 )
        ( -111.000000	-0.500000	0.000000 )
        ( -110.750000	-0.500000	0.000000 )
        ( -110.500000	-0.500000	0.000000 )
        ( -110.250000	-0.500000	0.000000 )
        ( -110.000000	-0.500000	0.000000 )
        ( -109.750000	-0.500000	0.000000 )
        ( -109.500000	-0.500000	0.000000 )
        ( -109.250000	-0.500000	0.000000 )
        ( -109.000000	-0.500000	0.000000 )
        ( -108.750000	-0.500000	0.000000 )
        ( -108.500000	-0.500000	0.000000 )
        ( -108.250000	-0.500000	0.000000 )
        ( -108.000000	-0.500000	0.000000 )
        ( -107.750000	-0.500000	0.000000 )
        ( -107.500000	-0.500000	0.000000 )
        ( -107.250000	-0.500000	0.000000 )
        ( -107.000000	-0.500000	0.000000 )
        ( -106.750000	-0.500000	0.000000 )
        ( -106.500000	-0.500000	0.000000 )
        ( -106.250000	-0.500000	0.000000 )
        ( -106.000000	-0.500000	0.000000 )
        ( -105.750000	-0.500000	0.000000 )
        ( -105.500000	-0.500000	0.000000 )
        ( -105.250000	-0.500000	0.000000 )
        ( -105.000000	-0.500000	0.000000 )
        ( -104.750000	-0.500000	0.000000 )
        ( -104.500000	-0.500000	0.000000 )
        ( -104.250000	-0.500000	0.000000 )
        ( -104.000000	-0.500000	0.000000 )
        ( -103.750000	-0.500000	0.000000 )
        ( -103.500000	-0.500000	0.000000 )
        ( -103.250000	-0.500000	0.000000 )
        ( -103.000000	-0.500000	0.000000 )
        ( -102.750000	-0.500000	0.000000 )
        ( -102.500000	-0.500000	0.000000 )
        ( -102.250000	-0.500000	0.000000 )
        ( -102.000000	-0.500000	0.000000 )
        ( -101.750000	-0.500000	0.000000 )
        ( -101.500000	-0.500000	0.000000 )
        ( -101.250000	-0.500000	0.000000 )
        ( -101.000000	-0.500000	0.000000 )
        ( -100.750000	-0.500000	0.000000 )
        ( -100.500000	-0.500000	0.000000 )
        ( -100.250000	-0.500000	0.000000 )
...
    )
    spline 3 2 (
        ( -125.000000	0.500000	0.000000 )
        ( -124.750000	0.500000	0.000000 )
        ( -124.500000	0.500000	0.000000 )
        ( -124.250000	0.500000	0.000000 )
        ( -124.000000	0.500000	0.000000 )
        ( -123.750000	0.500000	0.000000 )
        ( -123.500000	0.500000	0.000000 )
        ( -123.250000	0.500000	0.000000 )
        ( -123.000000	0.500000	0.000000 )
        ( -122.750000	0.500000	0.000000 )
        ( -122.500000	0.500000	0.000000 )
        ( -122.250000	0.500000	0.000000 )
        ( -122.000000	0.500000	0.000000 )
        ( -121.750000	0.500000	0.000000 )
        ( -121.500000	0.500000	0.000000 )
        ( -121.250000	0.500000	0.000000 )
        ( -121.000000	0.500000	0.000000 )
        ( -120.750000	0.500000	0.000000 )
        ( -120.500000	0.500000	0.000000 )
        ( -120.250000	0.500000	0.000000 )
        ( -120.000000	0.500000	0.000000 )
        ( -119.750000	0.500000	0.000000 )
        ( -119.500000	0.500000	0.000000 )
        ( -119.250000	0.500000	0.000000 )
        ( -119.000000	0.500000	0.000000 )
        ( -118.750000	0.500000	0.000000 )
        ( -118.500000	0.500000	0.000000 )
        ( -118.250000	0.500000	0.000000 )
        ( -118.000000	0.500000	0.000000 )
        ( -117.750000	0.500000	0.000000 )
        ( -117.500000	0.500000	0.000000 )
        ( -117.250000	0.500000	0.000000 )
        ( -117.000000	0.500000	0.000000 )
        ( -116.750000	0.500000	0.000000 )
        ( -116.500000	0.500000	0.000000 )
        ( -116.250000	0.500000	0.000000 )
        ( -116.000000	0.500000	0.000000 )
        ( -115.750000	0.500000	0.000000 )
        ( -115.500000	0.500000	0.000000 )
        ( -115.250000	0.500000	0.000000 )
        ( -115.000000	0.500000	0.000000 )
        ( -114.750000	0.500000	0.000000 )
        ( -114.500000	0.500000	0.000000 )
        ( -114.250000	0.500000	0.000000 )
        ( -114.000000	0.500000	0.000000 )
        ( -113.750000	0.500000	0.000000 )
        ( -113.500000	0.500000	0.000000 )
        ( -113.250000	0.500000	0.000000 )
        ( -113.000000	0.500000	0.000000 )
        ( -112.750000	0.500000	0.000000 )
        ( -112.500000	0.500000	0.000000 )
        ( -112.250000	0.500000	0.000000 )
        ( -112.000000	0.500000	0.000000 )
        ( -111.750000	0.500000	0.000000 )
        ( -111.500000	0.500000	0.000000 )
        ( -111.250000	0.500000	0.000000 )
        ( -111.000000	0.500000	0.000000 )
        ( -110.750000	0.500000	0.000000 )
        ( -110.500000	0.500000	0.000000 )
        ( -110.250000	0.500000	0.000000 )
        ( -110.000000	0.500000	0.000000 )
        ( -109.750000	0.500000	0.000000 )
        ( -109.500000	0.500000	0.000000 )
        ( -109.250000	0.500000	0.000000 )
        ( -109.000000	0.500000	0.000000 )
        ( -108.750000	0.500000	0.000000 )
        ( -108.500000	0.500000	0.000000 )
        ( -108.250000	0.500000	0.000000 )
        ( -108.000000	0.500000	0.000000 )
        ( -107.750000	0.500000	0.000000 )
        ( -107.500000	0.500000	0.000000 )
        ( -107.250000	0.500000	0.000000 )
        ( -107.000000	0.500000	0.000000 )
        ( -106.750000	0.500000	0.000000 )
        ( -106.500000	0.500000	0.000000 )
        ( -106.250000	0.500000	0.000000 )
        ( -106.000000	0.500000	0.000000 )
        ( -105.750000	0.500000	0.000000 )
        ( -105.500000	0.500000	0.000000 )
        ( -105.250000	0.500000	0.000000 )
        ( -105.000000	0.500000	0.000000 )
        ( -104.750000	0.500000	0.000000 )
        ( -104.500000	0.500000	0.000000 )
        ( -104.250000	0.500000	0.000000 )
        ( -104.000000	0.500000	0.000000 )
        ( -103.750000	0.500000	0.000000 )
        ( -103.500000	0.500000	0.000000 )
        ( -103.250000	0.500000	0.000000 )
        ( -103.000000	0.500000	0.000000 )
        ( -102.750000	0.500000	0.000000 )
        ( -102.500000	0.500000	0.000000 )
        ( -102.250000	0.500000	0.000000 )
        ( -102.000000	0.500000	0.000000 )
        ( -101.750000	0.500000	0.000000 )
        ( -101.500000	0.500000	0.000000 )
        ( -101.250000	0.500000	0.000000 )
        ( -101.000000	0.500000	0.000000 )
        ( -100.750000	0.500000	0.000000 )
        ( -100.500000	0.500000	0.000000 )
        ( -100.250000	0.500000	0.000000 )
...
);

blocks
(
    hex (0  1  2  3  4  5  6  7) (400 8 11)
      simpleGrading (
        ((0.46 0.37 0.1) (0.08 0.26 1) (0.46 0.37 10))
        ((0.5 0.5 2) (0.5 0.5 0.5))
        1
      )
    hex (4  5  6  7 8 9 10 11) (400 8 400)
      simpleGrading (
        ((0.46 0.37 0.1) (0.08 0.26 1) (0.46 0.37 10))
        ((0.5 0.5 2) (0.5 0.5 0.5))
        10
      )
);

boundary
(
    outlet
    {
      type patch;
      faces
      (
        (8  9  10  11)
      );
    }

    inlet
    {
      type patch;
      faces
      (
        (0   1   2   3)
      );
    }

    walls
    {
      type wall;
      faces
      (
        ( 0   1   5   4)
        ( 4   5   9   8)
        ( 2   6   7   3)
        ( 6  10  11   7)
      );
    }

    periodicx1
    {
      type cyclic;
      neighbourPatch periodicx2;
      faces
      (
        ( 0   3   7   4)
        ( 4   7  11   8)
      );
    }

    periodicx2
    {
      type cyclic;
      neighbourPatch periodicx1;
      faces
      (
        ( 1   2   6   5)
        ( 5   6  10   9)
      );
    }

);

mergePatchPairs
(
);

// ********************************************************************* //
